package _24_Builder.NonStaticMember;
//
import java.util.Locale;
//
public class NonStaticMember {
//    private String name; // 속성
//    private int age; // 속성
//    private String email; // 속성
//
//    private NonStaticMember() { //외부에서 생성할 수 없는 생성자 private걸어놨기 때문 그래서 빌더 클래스를 통해서 만등다.
//    }
//    //인스턴스 클래스(내부 클래스)
//    //빌더라는 클래스를 하나 만든다.
//    private final NonStaticMember target; //밖에 있는 논스테틱멤버를 필드로 가져기 오는데 final이 걸려있어서 초기화 시켜준다.
//    private Builder(NonStaticMember target) { //
//        this.target = target; //
//    }
//    //밖에이쓴 속성들을 빌더쪽에서 채워주낟. 일단 퍼블릭이라 외부에서 사용 가능하고
//    //네임에다 네임이라는 필드에 네이믈 넣어주고
//    //자기 자신을 받고있다.
//
//
//
//    //자기자신 객체를 반환하고 있다.
//
//
//    //자기자신 객체
//
//            //이 3개의 메소드가 빌더 아네인ㅆ는 메소드인데
//    //
//
//
//   // 퍼블릿 논스테틱멤버를 반환하는 빌더를 만든다.
//    //이안에는 네임 에이지 디메일이 채워져 있다.  메소드 체이닝을 통해 target를 반환 시켜준다. target안에  논트테틱 멤버안에 필드가 다채워진 멤버가 있다.
//
//
//
//
//    /*이걸 반환하는 빌더를 만든다. 논스 안에잇는 빌더를 반환해준다. 그리고 빌더라는
//     * 빈객체를 만들어 준다. pir걸어줬지만 같은 클래스 내에있기 때문에 여기서는 쓸 수 있다.
//    * 비어이쓴 논스 객체를 만들고 빌더객체안에 객체를 ()에 넣어준다.
//    *
//    * 반환을 내부클래스인 빌더 클래스는 반환한다. 이 안에 논스태틱멤버는 튜 논스테틴멤버 즉 빈 객체를 만드다. 하지만 프라이베이트를 걸어놨지만 가능하다.
//    * 논스테틱멤버안에 있는 빌더 객체를 생성ㅅ해서 ()여기에 넣어준다.
//    * 나중에 멤버메인 가서 */
//
}
